app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities" WHERE "activities"."owner_id" IN (1, 2) AND "activities"."trackable_type" = ? ORDER BY created_at DESC  [["trackable_type", "Post"]]
---
	def index
		@users = current_user.active_friends
		@users.push(current_user)
		case params[:content] when 'posts'
			@activities = PublicActivity::Activity.where(owner_id: @users, trackable_type: "Post").order('created_at DESC')