app/controllers/friendships_controller.rb

INSERT INTO "activities" ("trackable_type", "trackable_id", "owner_type", "owner_id", "key", "recipient_type", "recipient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def accept
		@friendship.accept_friendship
		@friendship.create_activity key: 'friendship.accepted', owner: @friendship.user, recipient: @friendship.friend

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def set_user
		@user = User.find(params[:user_id])

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def set_friendship
		@friendship = Friendship.find(params[:id])