app/controllers/posts_controller.rb

	def create
		@post = current_user.posts.new(post_params)
		if @post.save
			@post.create_activity key: 'post.created', owner: @post.user
---
INSERT INTO "posts" ("user_id", "content", "content_html", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["content", "This is my first VM Memory"], ["content_html", "<p>This is my first VM Memory</p>"], ["created_at", 2017-01-16 04:15:00 UTC], ["updated_at", 2017-01-16 04:15:00 UTC]]
INSERT INTO "activities" ("trackable_type", "trackable_id", "owner_type", "owner_id", "key", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["trackable_type", "Post"], ["trackable_id", 1], ["owner_type", "User"], ["owner_id", 1], ["key", "post.created"], ["created_at", 2017-01-16 04:15:00 UTC], ["updated_at", 2017-01-16 04:15:00 UTC]]