app/controllers/users_controller.rb

  def show #when clicking on a user, show the following on the user page
    @post = Post.new
    @posts = @user.posts.order('created_at DESC')
    @activities = PublicActivity::Activity.where(owner_id: @user.id).order('created_at DESC')
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY created_at DESC  [["user_id", 1]]
SELECT "activities".* FROM "activities" WHERE "activities"."owner_id" = ? ORDER BY created_at DESC  [["owner_id", 1]]

  def set_user
  	@user = User.find_by(username: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "chaudhryaziz"], ["LIMIT", 1]]